package gsm7bit

// 葡萄牙 gsm7bit 编码
// UDH contains 0x25 0x01 0x03
var GsmPortuguese = []rune{
	'@', 'Δ', ' ', '0', 'Í', 'P', '~', 'p',
	'£', '_', '!', '1', 'A', 'Q', 'a', 'q',
	'$', 'ª', '"', '2', 'B', 'R', 'b', 'r',
	'¥', 'Ç', '#', '3', 'C', 'S', 'c', 's',
	'ê', 'À', 'º', '4', 'D', 'T', 'd', 't',
	'é', '∞', '%', '5', 'E', 'U', 'e', 'u',
	'ú', '^', '&', '6', 'F', 'V', 'f', 'v',
	'í', '\\', '\'', '7', 'G', 'W', 'g', 'w',
	'ó', '€', '(', '8', 'H', 'X', 'h', 'x',
	'ç', 'Ó', ')', '9', 'I', 'Y', 'i', 'y',
	'\n', '|', '*', ':', 'J', 'Z', 'j', 'z',
	'Ô', esc, '+', ';', 'K', 'Ã', 'k', 'ã',
	'ô', 'Â', ',', '<', 'L', 'Õ', 'l', 'õ',
	'\r', 'â', '-', '=', 'M', 'Ú', 'm', '`',
	'Á', 'Ê', '.', '>', 'N', 'Ü', 'n', 'ü',
	'á', 'É', '/', '?', 'O', '§', 'o', 'à',
}

// UDH contains 0x24 0x01 0x03
var GsmPortugueseExt = []rune{
	zr0, zr0, zr0, zr0, '|', zr0, zr0, zr0,
	zr0, zr0, zr0, zr0, 'À', zr0, 'Â', zr0,
	zr0, 'Φ', zr0, zr0, zr0, zr0, zr0, zr0,
	zr0, 'Γ', zr0, zr0, zr0, zr0, zr0, zr0,
	zr0, '^', zr0, zr0, zr0, zr0, zr0, zr0,
	'ê', 'Ω', zr0, zr0, zr0, 'Ú', '€', 'ú',
	zr0, 'Π', zr0, zr0, zr0, zr0, zr0, zr0,
	zr0, 'Ψ', zr0, zr0, zr0, zr0, zr0, zr0,
	zr0, 'Σ', '{', zr0, zr0, zr0, zr0, zr0,
	'ç', 'Θ', '}', zr0, 'Í', zr0, 'í', zr0,
	'\f', zr0, zr0, zr0, zr0, zr0, zr0, zr0,
	'Ô', zr0, zr0, zr0, zr0, 'Ã', zr0, 'ã',
	'ô', zr0, zr0, '[', zr0, 'Õ', zr0, 'õ',
	zr0, zr0, zr0, '~', zr0, zr0, zr0, zr0,
	'Á', zr0, zr0, ']', zr0, zr0, zr0, zr0,
	'á', 'Ê', '\\', zr0, 'Ó', zr0, 'ó', 'â',
}
